{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 5, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "img"}, "name": "img", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv", "inbound_nodes": [[["img", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv_bn", "inbound_nodes": [[["conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu", "inbound_nodes": [[["conv_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res1a_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res1a_branch2a", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1a_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1a_branch2a", "inbound_nodes": [[["res1a_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_1", "inbound_nodes": [[["bn1a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res1a_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res1a_branch2b", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1a_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1a_branch2b", "inbound_nodes": [[["res1a_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["bn1a_branch2b", 0, 0, {}], ["re_lu", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_2", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2b_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2b_branch2a", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2b_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2b_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2b_branch2b", "inbound_nodes": [[["re_lu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2b_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}], ["re_lu_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_4", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3c_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3c_branch2a", "inbound_nodes": [[["re_lu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3c_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_5", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_5", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3c_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3c_branch2b", "inbound_nodes": [[["re_lu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3c_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}], ["re_lu_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_6", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_6", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4d_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4d_branch2a", "inbound_nodes": [[["re_lu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4d_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4d_branch2a", "inbound_nodes": [[["res4d_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_7", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_7", "inbound_nodes": [[["bn4d_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4d_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4d_branch2b", "inbound_nodes": [[["re_lu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4d_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4d_branch2b", "inbound_nodes": [[["res4d_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["bn4d_branch2b", 0, 0, {}], ["re_lu_6", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_8", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_8", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res5e_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res5e_branch2a", "inbound_nodes": [[["re_lu_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn5e_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn5e_branch2a", "inbound_nodes": [[["res5e_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_9", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_9", "inbound_nodes": [[["bn5e_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res5e_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res5e_branch2b", "inbound_nodes": [[["re_lu_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn5e_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn5e_branch2b", "inbound_nodes": [[["res5e_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["bn5e_branch2b", 0, 0, {}], ["re_lu_8", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_10", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_10", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res6g_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res6g_branch2a", "inbound_nodes": [[["re_lu_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn6g_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn6g_branch2a", "inbound_nodes": [[["res6g_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_11", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_11", "inbound_nodes": [[["bn6g_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res6g_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res6g_branch2b", "inbound_nodes": [[["re_lu_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn6g_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn6g_branch2b", "inbound_nodes": [[["res6g_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["bn6g_branch2b", 0, 0, {}], ["re_lu_10", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_12", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_12", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res7h_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res7h_branch2a", "inbound_nodes": [[["re_lu_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn7h_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn7h_branch2a", "inbound_nodes": [[["res7h_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13", "inbound_nodes": [[["bn7h_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res7h_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res7h_branch2b", "inbound_nodes": [[["re_lu_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn7h_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn7h_branch2b", "inbound_nodes": [[["res7h_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["bn7h_branch2b", 0, 0, {}], ["re_lu_12", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_14", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_14", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res8i_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res8i_branch2a", "inbound_nodes": [[["re_lu_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn8i_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn8i_branch2a", "inbound_nodes": [[["res8i_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_15", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_15", "inbound_nodes": [[["bn8i_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res8i_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res8i_branch2b", "inbound_nodes": [[["re_lu_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn8i_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn8i_branch2b", "inbound_nodes": [[["res8i_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["bn8i_branch2b", 0, 0, {}], ["re_lu_14", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_16", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_16", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res9j_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res9j_branch2a", "inbound_nodes": [[["re_lu_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn9j_branch2a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn9j_branch2a", "inbound_nodes": [[["res9j_branch2a", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_17", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_17", "inbound_nodes": [[["bn9j_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res9j_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res9j_branch2b", "inbound_nodes": [[["re_lu_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn9j_branch2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn9j_branch2b", "inbound_nodes": [[["res9j_branch2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["bn9j_branch2b", 0, 0, {}], ["re_lu_16", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_18", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_18", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "pi", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "pi", "inbound_nodes": [[["re_lu_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "v", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "v", "inbound_nodes": [[["re_lu_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn_pi", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_pi", "inbound_nodes": [[["pi", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn_v", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_v", "inbound_nodes": [[["v", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_19", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_19", "inbound_nodes": [[["bn_pi", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_20", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_20", "inbound_nodes": [[["bn_v", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "p_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "p_flatten", "inbound_nodes": [[["re_lu_19", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "v_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "v_flatten", "inbound_nodes": [[["re_lu_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["p_flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["v_flatten", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "probability", "trainable": true, "dtype": "float32", "axis": -1}, "name": "probability", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "value", "trainable": true, "dtype": "float32", "units": 4, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "value", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["img", 0, 0]], "output_layers": [["probability", 0, 0], ["value", 0, 0]]}}, "training_config": {"loss": {"probability": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "value": {"class_name": "MeanSquaredError", "config": {"reduction": "auto", "name": "mean_squared_error"}}}, "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of41.bin", "group1-shard2of41.bin", "group1-shard3of41.bin", "group1-shard4of41.bin", "group1-shard5of41.bin", "group1-shard6of41.bin", "group1-shard7of41.bin", "group1-shard8of41.bin", "group1-shard9of41.bin", "group1-shard10of41.bin", "group1-shard11of41.bin", "group1-shard12of41.bin", "group1-shard13of41.bin", "group1-shard14of41.bin", "group1-shard15of41.bin", "group1-shard16of41.bin", "group1-shard17of41.bin", "group1-shard18of41.bin", "group1-shard19of41.bin", "group1-shard20of41.bin", "group1-shard21of41.bin", "group1-shard22of41.bin", "group1-shard23of41.bin", "group1-shard24of41.bin", "group1-shard25of41.bin", "group1-shard26of41.bin", "group1-shard27of41.bin", "group1-shard28of41.bin", "group1-shard29of41.bin", "group1-shard30of41.bin", "group1-shard31of41.bin", "group1-shard32of41.bin", "group1-shard33of41.bin", "group1-shard34of41.bin", "group1-shard35of41.bin", "group1-shard36of41.bin", "group1-shard37of41.bin", "group1-shard38of41.bin", "group1-shard39of41.bin", "group1-shard40of41.bin", "group1-shard41of41.bin"], "weights": [{"name": "bn1a_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn1a_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn1a_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn1a_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn1a_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn1a_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn1a_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn1a_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn2b_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn2b_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn2b_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn2b_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn2b_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn2b_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn2b_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn2b_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn4d_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn4d_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn4d_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn4d_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn4d_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn4d_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn4d_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn4d_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn5e_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5e_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5e_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5e_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn5e_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5e_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5e_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5e_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn6g_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn6g_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn6g_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn6g_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn6g_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn6g_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn6g_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn6g_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn7h_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn7h_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn7h_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn7h_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn7h_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn7h_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn7h_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn7h_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn8i_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn8i_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn8i_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn8i_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn8i_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn8i_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn8i_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn8i_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn9j_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn9j_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn9j_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn9j_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn9j_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn9j_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn9j_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn9j_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn_pi/gamma", "shape": [2], "dtype": "float32"}, {"name": "bn_pi/beta", "shape": [2], "dtype": "float32"}, {"name": "bn_pi/moving_mean", "shape": [2], "dtype": "float32"}, {"name": "bn_pi/moving_variance", "shape": [2], "dtype": "float32"}, {"name": "bn_v/gamma", "shape": [1], "dtype": "float32"}, {"name": "bn_v/beta", "shape": [1], "dtype": "float32"}, {"name": "bn_v/moving_mean", "shape": [1], "dtype": "float32"}, {"name": "bn_v/moving_variance", "shape": [1], "dtype": "float32"}, {"name": "conv/kernel", "shape": [3, 3, 10, 512], "dtype": "float32"}, {"name": "conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [50, 200], "dtype": "float32"}, {"name": "dense/bias", "shape": [200], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [25, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "pi/kernel", "shape": [1, 1, 512, 2], "dtype": "float32"}, {"name": "pi/bias", "shape": [2], "dtype": "float32"}, {"name": "res1a_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res1a_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res1a_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res1a_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "res2b_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res2b_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res2b_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res2b_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "res3c_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res3c_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res3c_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res3c_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "res4d_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res4d_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res4d_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res4d_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "res5e_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5e_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res5e_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5e_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "res6g_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res6g_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res6g_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res6g_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "res7h_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res7h_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res7h_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res7h_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "res8i_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res8i_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res8i_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res8i_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "res9j_branch2a/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res9j_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "res9j_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res9j_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "v/kernel", "shape": [1, 1, 512, 1], "dtype": "float32"}, {"name": "v/bias", "shape": [1], "dtype": "float32"}, {"name": "value/kernel", "shape": [256, 4], "dtype": "float32"}, {"name": "value/bias", "shape": [4], "dtype": "float32"}]}]}